model.summary()
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 560, 840, 3)   0                                            
____________________________________________________________________________________________________
block1_conv1 (Conv2D)            (None, 560, 840, 64)  1792        input_1[0][0]                    
____________________________________________________________________________________________________
block1_conv2 (Conv2D)            (None, 560, 840, 64)  36928       block1_conv1[0][0]               
____________________________________________________________________________________________________
block1_pool (MaxPooling2D)       (None, 280, 420, 64)  0           block1_conv2[0][0]               
____________________________________________________________________________________________________
block2_conv1 (Conv2D)            (None, 280, 420, 128) 73856       block1_pool[0][0]                
____________________________________________________________________________________________________
block2_conv2 (Conv2D)            (None, 280, 420, 128) 147584      block2_conv1[0][0]               
____________________________________________________________________________________________________
block2_pool (MaxPooling2D)       (None, 140, 210, 128) 0           block2_conv2[0][0]               
____________________________________________________________________________________________________
block3_conv1 (Conv2D)            (None, 140, 210, 256) 295168      block2_pool[0][0]                
____________________________________________________________________________________________________
block3_conv2 (Conv2D)            (None, 140, 210, 256) 590080      block3_conv1[0][0]               
____________________________________________________________________________________________________
block3_conv3 (Conv2D)            (None, 140, 210, 256) 590080      block3_conv2[0][0]               
____________________________________________________________________________________________________
block3_pool (MaxPooling2D)       (None, 70, 105, 256)  0           block3_conv3[0][0]               
____________________________________________________________________________________________________
block4_conv1 (Conv2D)            (None, 70, 105, 512)  1180160     block3_pool[0][0]                
____________________________________________________________________________________________________
block4_conv2 (Conv2D)            (None, 70, 105, 512)  2359808     block4_conv1[0][0]               
____________________________________________________________________________________________________
block4_conv3 (Conv2D)            (None, 70, 105, 512)  2359808     block4_conv2[0][0]               
____________________________________________________________________________________________________
block4_pool (MaxPooling2D)       (None, 35, 52, 512)   0           block4_conv3[0][0]               
____________________________________________________________________________________________________
block5_conv1 (Conv2D)            (None, 35, 52, 512)   2359808     block4_pool[0][0]                
____________________________________________________________________________________________________
block5_conv2 (Conv2D)            (None, 35, 52, 512)   2359808     block5_conv1[0][0]               
____________________________________________________________________________________________________
block5_conv3 (Conv2D)            (None, 35, 52, 512)   2359808     block5_conv2[0][0]               
____________________________________________________________________________________________________
block5_pool (MaxPooling2D)       (None, 17, 26, 512)   0           block5_conv3[0][0]               
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 11, 20, 4096)  102764544   block5_pool[0][0]                
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 11, 20, 4096)  0           conv2d_1[0][0]                   
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 11, 20, 4096)  16781312    dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 11, 20, 4096)  0           conv2d_2[0][0]                   
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 11, 20, 4)     16388       dropout_2[0][0]                  
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 35, 52, 4)     2052        block4_pool[0][0]                
____________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTransp (None, 24, 42, 4)     256         conv2d_3[0][0]                   
____________________________________________________________________________________________________
cropping2d_1 (Cropping2D)        (None, 24, 42, 4)     0           conv2d_4[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 24, 42, 4)     0           conv2d_transpose_1[0][0]         
                                                                   cropping2d_1[0][0]               
____________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTransp (None, 400, 688, 4)   16384       add_1[0][0]                      
____________________________________________________________________________________________________
cropping2d_2 (Cropping2D)        (None, 360, 640, 4)   0           conv2d_transpose_2[0][0]         
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 360, 640, 4)   0           cropping2d_2[0][0]               
====================================================================================================
Total params: 134,295,624
Trainable params: 119,580,936
Non-trainable params: 14,714,688
_______________________

